DataProcessors/МониторРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>МониторРасчетов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ОСВК</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сальдо</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоКДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоККт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОСВ1549</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Авансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НСП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Доотгрузка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокАванса</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокОтгрузки</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоотгр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НСП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

DataProcessors/МониторРасчетов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)            
	
	Если НЕ Контрагент.Пустая() Тогда 
	    СформироватьОСВКПоКДНаСервере();
		СформироватьОперацииНаСервере();
	Иначе
		Если НЕ ПарныеСчета Тогда 
			СформироватьОСВКНаСервере();
		Иначе
			СформироватьОСВКПарыНаСервере();
		КонецЕсли;
	КонецЕсли;		
	СформироватьОСВ1549НаСервере();
	СформироватьАвансыНаСервере();
	СформироватьДоотгрузкуНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОСВКНаСервере()
	
	ВидыСубконто = Новый СписокЗначений;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОСВ.Субконто1 КАК Контрагент,
	|	ОСВ.Субконто2 КАК Договор,
	|	ОСВ.Счет КАК Счет,
	|	ОСВ.СуммаОборотДт КАК Дебит,
	|	ОСВ.СуммаОборотКт КАК Кредит,
	|	ОСВ.СуммаНачальныйОстатокДт - ОСВ.СуммаНачальныйОстатокКт КАК СальдоН,
	|	ОСВ.СуммаКонечныйОстатокДт - ОСВ.СуммаКонечныйОстатокКт КАК СальдоК
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, , , , &ВидыСубконто, ) КАК ОСВ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	Счет
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Объект.ОСВК.Загрузить(ТЗ);
	
	//Для Каждого СТЧ Из Объект.ОСВК Цикл
	//	
	//	СТЧ.СальдоНДт 	= СТЧ.СальдоНДт - СТЧ.СальдоНКт;
	//	СТЧ.СальдоНКт 	= 0;
	//	Если СТЧ.СальдоНДт < 0 Тогда 
	//		СТЧ.СальдоНКт 	= - СТЧ.СальдоНДт;
	//		СТЧ.СальдоНДт 	= 0;
	//	КонецЕсли;			
	//	
	//	СТЧ.СальдоКДт 	= СТЧ.СальдоНДт - СТЧ.СальдоНКт + СТЧ.Дебит - СТЧ.Кредит;
	//	СТЧ.СальдоККт 	= 0;
	//	Если СТЧ.СальдоКДт < 0 Тогда 
	//		СТЧ.СальдоККт 	= - СТЧ.СальдоКДт;
	//		СТЧ.СальдоКДт 	= 0;
	//	КонецЕсли;			
	//	
	//КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОСВКПарыНаСервере()
	
	ВидыСубконто = Новый СписокЗначений;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Хозрасчетный.Ссылка КАК Счет,
	|	Хозрасчетный.ПарныйСчет
	|ПОМЕСТИТЬ ВТПары
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.ПарныйСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПары.Счет
	|ПОМЕСТИТЬ ВТСчета
	|ИЗ
	|	ВТПары КАК ВТПары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПары.ПарныйСчет
	|ИЗ
	|	ВТПары КАК ВТПары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОСВ.Субконто1 КАК Контрагент,
	|	ОСВ.Субконто2 КАК Договор,
	|	ОСВ.Счет КАК Счет,
	|	ОСВ.СуммаОборотДт КАК Дебит,
	|	ОСВ.СуммаОборотКт КАК Кредит,
	|	ОСВ.СуммаНачальныйОстатокДт - ОСВ.СуммаНачальныйОстатокКт КАК СальдоН,
	|	ОСВ.СуммаКонечныйОстатокДт - ОСВ.СуммаКонечныйОстатокКт КАК СальдоК,
	|	ВТПарыП.Счет КАК Счет1,
	|	ВТПарыП.ПарныйСчет,
	|	ОСВ.Счет КАК Счет2,
	|	ОСВ.Субконто1,
	|	ОСВ.Субконто2,
	|	ОСВ.Субконто3,
	|	ОСВ.Организация,
	|	ОСВ.Валюта
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачПериода,
	|			&КонПериода,
	|			,
	|			,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТСчета.Счет
	|				ИЗ
	|					ВТСчета КАК ВТСчета),
	|			&ВидыСубконто,
	|			) КАК ОСВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПары КАК ВТПары
	|		ПО ОСВ.Счет = ВТПары.Счет
	|			И ОСВ.Счет = ВТПары.ПарныйСчет,
	|	ВТПары КАК ВТПарыП
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	Счет
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Объект.ОСВК.Загрузить(ТЗ);
	
	//Для Каждого СТЧ Из Объект.ОСВК Цикл
	//	
	//	СТЧ.СальдоНДт 	= СТЧ.СальдоНДт - СТЧ.СальдоНКт;
	//	СТЧ.СальдоНКт 	= 0;
	//	Если СТЧ.СальдоНДт < 0 Тогда 
	//		СТЧ.СальдоНКт 	= - СТЧ.СальдоНДт;
	//		СТЧ.СальдоНДт 	= 0;
	//	КонецЕсли;			
	//	
	//	СТЧ.СальдоКДт 	= СТЧ.СальдоНДт - СТЧ.СальдоНКт + СТЧ.Дебит - СТЧ.Кредит;
	//	СТЧ.СальдоККт 	= 0;
	//	Если СТЧ.СальдоКДт < 0 Тогда 
	//		СТЧ.СальдоККт 	= - СТЧ.СальдоКДт;
	//		СТЧ.СальдоКДт 	= 0;
	//	КонецЕсли;			
	//	
	//КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОСВКПоКДНаСервере()
	
	ВидыСубконто = Новый СписокЗначений;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОСВ.Субконто1 КАК Контрагент,
	|	ОСВ.Субконто2 КАК Договор,
	|	ОСВ.Счет КАК Счет,
	|	ОСВ.СуммаОборотДт КАК Дебит,
	|	ОСВ.СуммаОборотКт КАК Кредит,
	|	ОСВ.СуммаНачальныйОстатокДт - ОСВ.СуммаНачальныйОстатокКт КАК СальдоН,
	|	ОСВ.СуммаКонечныйОстатокДт - ОСВ.СуммаКонечныйОстатокКт КАК СальдоК
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачПериода,
	|			&КонПериода,
	|			,
	|			,
	|			Счет = &Счет
	|					И &Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				ИЛИ &Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					И Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНаАвансы),
	|			&ВидыСубконто,
	|			Субконто1 = &Контрагент
	|				И (Субконто2 = &Договор
	|					ИЛИ &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))) КАК ОСВ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	Счет
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", 	НачПериода);
	Запрос.УстановитьПараметр("КонПериода", 	КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ВидыСубконто", 	ВидыСубконто);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Счет",	 		Счет);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Объект.ОСВК.Загрузить(ТЗ);
	
	//Для Каждого СТЧ Из Объект.ОСВК Цикл
	//	
	//	СТЧ.СальдоНДт 	= СТЧ.СальдоНДт - СТЧ.СальдоНКт;
	//	СТЧ.СальдоНКт 	= 0;
	//	Если СТЧ.СальдоНДт < 0 Тогда 
	//		СТЧ.СальдоНКт 	= - СТЧ.СальдоНДт;
	//		СТЧ.СальдоНДт 	= 0;
	//	КонецЕсли;			
	//	
	//	СТЧ.СальдоКДт 	= СТЧ.СальдоНДт - СТЧ.СальдоНКт + СТЧ.Дебит - СТЧ.Кредит;
	//	СТЧ.СальдоККт 	= 0;
	//	Если СТЧ.СальдоКДт < 0 Тогда 
	//		СТЧ.СальдоККт 	= - СТЧ.СальдоКДт;
	//		СТЧ.СальдоКДт 	= 0;
	//	КонецЕсли;			
	//	
	//КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОперацииНаСервере()
	
	ВидыСубконто = Новый СписокЗначений;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозОбороты.Период КАК Дата,
	|	ХозОбороты.Регистратор КАК Документ,
	|	ХозОбороты.СуммаОборотДт КАК Дебит,
	|	ХозОбороты.СуммаОборотКт КАК Кредит
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачПериода,
	|			&КонПериода,
	|			Регистратор,
	|			Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНаАвансы),
	|			&ВидыСубконто,
	|			Субконто1 = &Контрагент
	|				И (Субконто2 = &Договор
	|					ИЛИ &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)), 
	|			,
	|			) КАК ХозОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Документ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", 	НачПериода);
	Запрос.УстановитьПараметр("КонПериода", 	КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ВидыСубконто", 	ВидыСубконто);	
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Договор", 		Договор);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Объект.Операции.Загрузить(ТЗ);
		
	
КонецПроцедуры

&НаКлиенте
Процедура НачПериодаПриИзменении(Элемент)
	КонПериода = КонецМесяца(НачПериода);
КонецПроцедуры

&НаСервере
Процедура СформироватьОСВ1549НаСервере()
	
	ВидыСубконто = Новый СписокЗначений;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОСВ.СуммаОборотДт КАК Дебит,
	|	ОСВ.СуммаОборотКт КАК Кредит,
	|	ОСВ.СуммаНачальныйОстатокДт - ОСВ.СуммаНачальныйОстатокКт КАК СальдоН,
	|	ОСВ.СуммаКонечныйОстатокДт - ОСВ.СуммаКонечныйОстатокКт КАК СальдоК
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачПериода,
	|			&КонПериода,
	|			,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНаАвансы),
	|			&ВидыСубконто,
	|			Субконто1 = &Контрагент
	|				И Субконто2 = &Договор) КАК ОСВ";
	
	Запрос.УстановитьПараметр("НачПериода", НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Договор", 		Договор);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Объект.ОСВ1549.Загрузить(ТЗ);
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАвансыНаСервере()
	
	ВидыСубконто = Новый СписокЗначений;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозОбороты.Период КАК Дата,
	|	ХозОбороты.Регистратор КАК Документ,
	|	ХозОбороты.СуммаОборотДт КАК Дебит,
	|	ХозОбороты.СуммаОборотКт КАК Кредит,
	|	ХозОбороты.Субконто1,
	|	ХозОбороты.Субконто2
	|ПОМЕСТИТЬ ВТОплата
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачПериода,
	|			&КонПериода,
	|			Регистратор,
	|			Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНаАвансы),
	|			&ВидыСубконто,
	|			Субконто1 = &Контрагент
	|				И Субконто2 = &Договор,
	|			,
	|			) КАК ХозОбороты
	|ГДЕ
	|	ХозОбороты.СуммаОборотКт <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АИД.ДокументА КАК ДокАванса,
	|	АИД.Сумма,
	|	АИД.ВидДвижения,
	|	АИД.СуммаНДС,
	|	АИД.СуммаНСП,
	|	АИД.Регистратор,
	|	АИД.Контрагент,
	|	АИД.Договор
	|ПОМЕСТИТЬ ВТАвансы
	|ИЗ
	|	РегистрНакопления.АвансыДоотгрузка КАК АИД
	|ГДЕ
	|	АИД.Период МЕЖДУ &НачПериода И &КонПериода
	|	И АИД.Договор = &Договор
	|	И АИД.Контрагент = &Контрагент
	|	И АИД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОплата.Дата КАК Дата,
	|	ВТОплата.Документ КАК Документ,
	|	ВТОплата.Кредит КАК СуммаОп,
	|	ВТАвансы.Сумма КАК СуммаАванса,
	|	ВТАвансы.СуммаНДС КАК НДС,
	|	ВТАвансы.СуммаНСП КАК НСП
	|ИЗ
	|	ВТОплата КАК ВТОплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАвансы КАК ВТАвансы
	|		ПО ВТОплата.Документ = ВТАвансы.ДокАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Документ
	|АВТОУПОРЯДОЧИВАНИЕ";

	
	Запрос.УстановитьПараметр("НачПериода", 	НачПериода);
	Запрос.УстановитьПараметр("КонПериода", 	КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ВидыСубконто", 	ВидыСубконто);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Договор", 		Договор);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Объект.Авансы.Загрузить(ТЗ);
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДоотгрузкуНаСервере()
	
	ВидыСубконто = Новый СписокЗначений;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозОбороты.Период КАК Дата,
	|	ХозОбороты.Регистратор КАК ДокОтгрузки,
	|	ХозОбороты.СуммаОборотДт КАК Дебит,
	|	ХозОбороты.СуммаОборотКт КАК Кредит,
	|	ХозОбороты.Субконто1,
	|	ХозОбороты.Субконто2
	|ПОМЕСТИТЬ ВТОтгрузка
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачПериода,
	|			&КонПериода,
	|			Регистратор,
	|			Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНаАвансы),
	|			&ВидыСубконто,
	|			Субконто1 = &Контрагент
	|				И Субконто2 = &Договор,
	|			,
	|			) КАК ХозОбороты
	|ГДЕ
	|	ХозОбороты.СуммаОборотДт <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АИД.ДокументА КАК ДокАванса,
	|	АИД.Сумма,
	|	АИД.ВидДвижения,
	|	АИД.СуммаНДС,
	|	АИД.СуммаНСП,
	|	АИД.Регистратор,
	|	АИД.Контрагент,
	|	АИД.Договор,
	|	АИД.ДокументОтгр
	|ПОМЕСТИТЬ ВТДоотгр
	|ИЗ
	|	РегистрНакопления.АвансыДоотгрузка КАК АИД
	|ГДЕ
	|	АИД.Период МЕЖДУ &НачПериода И &КонПериода
	|	И АИД.Договор = &Договор
	|	И АИД.Контрагент = &Контрагент
	|	И АИД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОотгрузка.Дата КАК Дата,
	|	ВТОотгрузка.ДокОтгрузки КАК ДокОтгрузки,
	|	ВТОотгрузка.Дебит КАК СуммаОп,
	|	ВТДоотгр.Сумма КАК СуммаДоотгр,
	|	ВТДоотгр.СуммаНДС КАК НДС,
	|	ВТДоотгр.СуммаНСП КАК НСП,
	|	ВТДоотгр.ДокАванса КАК ДокАванса
	|ИЗ
	|	ВТОтгрузка КАК ВТОотгрузка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоотгр КАК ВТДоотгр
	|		ПО ВТОотгрузка.ДокОтгрузки = ВТДоотгр.ДокументОтгр
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	ДокАванса
	|АВТОУПОРЯДОЧИВАНИЕ";

	
	Запрос.УстановитьПараметр("НачПериода", 	НачПериода);
	Запрос.УстановитьПараметр("КонПериода", 	КонецДня(КонПериода));
	Запрос.УстановитьПараметр("ВидыСубконто", 	ВидыСубконто);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Договор", 		Договор);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Объект.Доотгрузка.Загрузить(ТЗ);
	
	
КонецПроцедуры
